---
kind: property
id: P:Autodesk.Revit.DB.Architecture.HandRailType.SupportLayout
source: html/ee4e1b82-f8ac-554d-dc4e-1201dc9299a7.htm
---
# Autodesk.Revit.DB.Architecture.HandRailType.SupportLayout Property

The support layout method of the handrail.

## Syntax (C#)
```csharp
public RailSupportsLayout SupportLayout { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The rail has no support specified so the data being set is not applicable.